Documents/бит_УстановкаРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаРаспределения</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СведенияПоУслугамЛС</xr:Item>
				<xr:Item>InformationRegister.бит_РаспределенияНаУслугах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийУстановкаРаспределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Распределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ГрупповыеСчетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ГрупповыеСчетчики</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьИндивидуальныйСчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрупповойСчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПорядковыйНомерСчетчикаПоУслуге</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СчетчикиНаУслугахОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СчетчикиНаУслугахОбщий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипСчетчика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Многотарифный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоУстановкиСчетчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет общедомового счетчика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСтавкуПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетчикСЗависимымиУслугами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПравилоУменьшения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределенияУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_РаспределенияНаУслугах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_РаспределенияНаУслугах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Распределения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_УстановкаРаспределения/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункцииДокумента

Процедура ПроверитьИЗаполнитьСтрокуЛС(ДатаДок, ЛицевойСчет, Услуга, Объект, СтрокаТЧ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , ДатаДок);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуга"     , Услуга);
	Запрос.УстановитьПараметр("Объект"     , Объект);
	
	Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаРаспределения.УстановкаРаспределения Тогда
		
		Запрос.Текст =
		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ОтветственноеЛицо,
		|	Счетчики.ЛицевойСчет,
		|	Счетчики.Услуга,
		|	Счетчики.ГрупповойСчетчик КАК Счетчик,
		|	Счетчики.Индивидуальный
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|			бит_ГрупповыеСчетчикиСрезПоследних.Услуга КАК Услуга,
		|			бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик КАК ГрупповойСчетчик,
		|			ЛОЖЬ КАК Индивидуальный
		|		ИЗ
		|			РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(
		|					&Дата,
		|					ЛицевойСчет = &ЛицевойСчет
		|						И Услуга = &Услуга) КАК бит_ГрупповыеСчетчикиСрезПоследних
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
		|						&Дата,
		|						Объект = &Объект
		|							И Услуга = &Услуга
		|							И ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|				ПО бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик = бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик
		|					И бит_ГрупповыеСчетчикиСрезПоследних.Услуга = бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга
		|					И бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание = бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект
		|		ГДЕ
		|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
		|			И бит_ГрупповыеСчетчикиСрезПоследних.Использовать
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
		|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
		|			ИСТИНА
		|		ИЗ
		|			РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
		|					&Дата,
		|					Объект = &ЛицевойСчет
		|						И Услуга = &Услуга
		|						И ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|		ГДЕ
		|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать) КАК Счетчики
		|		ПО бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет = Счетчики.ЛицевойСчет
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ответственноеЛицо)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Счетчик) Тогда
				Если НЕ Выборка.Индивидуальный Тогда
					
					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("На лицевом счете №" + ЛицевойСчет + " на услуге:""" + Услуга + """ установлен групповой счетчик №" + Выборка.Счетчик 
					+ " требуется его снять ");
					
					СтрокаТЧ.Адрес = "";
					СтрокаТЧ.ОтветственноеЛицо    = Справочники.бит_Проживающие.ПустаяСсылка();
					СтрокаТЧ.ЛицевойСчет          = Справочники.бит_ЛицевыеСчета.ПустаяСсылка();
					
					Возврат;
					
				Иначе			   
					
					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("На лицевом счете №" + ЛицевойСчет + " на услуге:""" + Услуга + """ установлен индивидуальный счетчик №" + Выборка.Счетчик 
					+ " требуется его снять ");
					
					СтрокаТЧ.Адрес = "";
					СтрокаТЧ.ОтветственноеЛицо    = Справочники.бит_Проживающие.ПустаяСсылка();
					СтрокаТЧ.ЛицевойСчет          = Справочники.бит_ЛицевыеСчета.ПустаяСсылка();
					
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
		|	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
		|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет,
		|	бит_РаспределенияНаУслугахСрезПоследних.Распределение
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
		|				&Дата,
		|				ЛицевойСчет = &ЛицевойСчет
		|					И Услуга = &Услуга
		|					И Объект = &Объект) КАК бит_РаспределенияНаУслугахСрезПоследних
		|		ПО бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет = бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ответственноеЛицо)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Распределение) Тогда
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("На лицевом счете №" + ЛицевойСчет + " на услуге:""" + Выборка.Услуга + """ установлено распределение " + Выборка.Распределение 
				+ " требуется его снять ");
				
				СтрокаТЧ.Адрес = "";
				СтрокаТЧ.ОтветственноеЛицо    = Справочники.бит_Проживающие.ПустаяСсылка();
				СтрокаТЧ.ЛицевойСчет          = Справочники.бит_ЛицевыеСчета.ПустаяСсылка();
				
				Прервать;
				
			КонецЕсли;
			
			СтрокаТЧ.Адрес = Строка(ЛицевойСчет.УлицаЛицевогоСчета) + ", " + Строка(ЛицевойСчет.Здание);;
			СтрокаТЧ.ОтветственноеЛицо    = Выборка.ФизЛицо;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или.
// Заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	
	СтруктураОбязательныхПолей = Новый Структура("Объект");
	СтруктураОбязательныхПолей.Вставить("Распределение");
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаТЧ,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Услуги", Новый Структура("Услуга"), Отказ, Заголовок);
	
КонецПроцедуры // ПроверкаРеквизитов()

Процедура ПроверкаУслугНаЛС(Отказ, Заголовок)
	
	Для каждого СтрокаЛС Из ЛицевыеСчета Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать,
		|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
		|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
		
		Запрос.УстановитьПараметр("Период"		 , Дата);
		Запрос.УстановитьПараметр("ЛицевойСчет" , СтрокаЛС.ЛицевойСчет);
		
		Результат 	= Запрос.Выполнить().Выгрузить();
		
		Для каждого Строка Из Услуги Цикл
			
			СтрокаИзменения = Результат.Найти(Строка.Услуга);
			
			Если СтрокаИзменения = Неопределено Тогда
				
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("На лицевом счете: "+ СтрокаЛС.ЛицевойСчет + "нет услуги: "+ Строка.Услуга +", невозможно установить рапрседеление.");
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам,Отказ, Заголовок)
	
	// Регистр бит_РаспределенияНаУслугах.
	Для Каждого СтрокаЛС из ЛицевыеСчета Цикл
		
		Движение = Движения.бит_РаспределенияНаУслугах.Добавить();
		Движение.Период   	   = Дата;
		Движение.Регистратор   = Ссылка;
		Движение.Услуга    	   = СтрокаЛС.Услуга;
		Движение.Объект    	   = Объект;
		Движение.Распределение = Распределение;
		Движение.ЛицевойСчет   = СтрокаЛС.ЛицевойСчет;
		Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаРаспределения.УстановкаРаспределения Тогда
			Движение.Использовать = Истина;
		Иначе
			Движение.Использовать  = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Движения_СведениямПоУслугам();
	
КонецПроцедуры

// БИТ_ЖКХ Процедура заполняет регистр Сведения по услугам ЛС.
//
// Параметры:
//  СписокЛС    – Массив - Список лицевых счетов.
//
//  СписокУслуг – Массив - Список услуг.
//
Процедура Движения_СведениямПоУслугам()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент"       , МоментВремени());
	Запрос.УстановитьПараметр("Распределение", Распределение);
	Запрос.УстановитьПараметр("Объект"       , Объект );
	Запрос.УстановитьПараметр("Ссылка"       , Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_УстановкаРаспределенияЛицевыеСчета.ЛицевойСчет,
	|	бит_УстановкаРаспределенияЛицевыеСчета.Услуга,
	|	бит_УстановкаРаспределенияЛицевыеСчета.ЛицевойСчет.Наименование КАК Наименование,
	|	бит_УстановкаРаспределенияЛицевыеСчета.Ссылка.Объект КАК ЗДание
	|ПОМЕСТИТЬ СписокЛС
	|ИЗ
	|	Документ.бит_УстановкаРаспределения.ЛицевыеСчета КАК бит_УстановкаРаспределенияЛицевыеСчета
	|ГДЕ
	|	бит_УстановкаРаспределенияЛицевыеСчета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_РаспределенияНаУслугахСрезПоследних.Объект,
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
	|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет
	|ПОМЕСТИТЬ Распределения
	|ИЗ
	|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(
	|			&Момент,
	|			НЕ Распределение = &Распределение
	|				И Объект = &Объект) КАК бит_РаспределенияНаУслугахСрезПоследних
	|ГДЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_РаспределенияНаУслугахСрезПоследних.Объект,
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
	|	бит_РаспределенияНаУслугахСрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ОсновнойСпособРасчета КАК ОсновнойСпособРасчета,
	|	СписокЛС.ЛицевойСчет,
	|	СписокЛС.Услуга,
	|	СписокЛС.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА Распределения.ЛицевойСчет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьРаспределение,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета
	|ИЗ
	|	СписокЛС КАК СписокЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ПО СписокЛС.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|			И СписокЛС.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Распределения КАК Распределения
	|		ПО СписокЛС.Услуга = Распределения.Услуга
	|			И СписокЛС.ЛицевойСчет = Распределения.ЛицевойСчет
	|			И СписокЛС.ЗДание = Распределения.Объект
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.ДА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Распределения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СведенияПоУслугам = Движения.бит_СведенияПоУслугамЛС;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись =  СведенияПоУслугам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Период = Дата;
		
		Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаРаспределения.УстановкаРаспределения  Тогда
			НоваяЗапись.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоРаспределению;
		Иначе	
			НоваяЗапись.СпособРасчета = ?(Выборка.ЕстьРаспределение, Выборка.СпособРасчета, Выборка.ОсновнойСпособРасчета);
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // Движения_СведениямПоУслугам() 

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Проверяем на заполнение обязательные реквизиты.
//
Процедура ПередЗаписью(Отказ)
	
	// При обмене проверок не выполняем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

// Обработчик события "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Услуга" ,"Услуга");
	СтруктураПолей.Вставить("ЛицевойСчет" ,"ЛицевойСчет");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЛицевыеСчета", СтруктураПолей);
	ТаблицаУслуг              = РезультатЗапросаПоУслугам.Выгрузить();
	
	ПроверкаРеквизитовТЧ(ТаблицаУслуг, СтруктураШапкиДокумента,Отказ, Заголовок);
	
	ПроверкаУслугНаЛС(Отказ, Заголовок);
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаУслуг, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ_07122013_начало_изменений
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ВидОперации   = Перечисления.бит_ВидыОперацийУстановкаРаспределения.УстановкаРаспределения;
	
	Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
КонецПроцедуры
// БИТ_ЖКХ_07122013_окончание_изменений

#КонецОбласти

#КонецЕсли
